name = 'james'
my_name = '小明'


# 变量的定义规则
# 1, 变量由‘字母’、‘数字’、‘下划线’组成,数字不能作为开头
# ABCaa123_____ = 1
# 2, 对大小写是敏感的（是区分大小写的）

# 变量命名的规则
# 1，变量名称由 字母 下划线 数字 组成
# 2，变量不能以数字开头
# 3，系统关键字不能作为变量名称

# print id 是一个函数 如果作为变量的名称 那么函数就会失去原本的功能
# 系统关键字 以红色的状态呈现的变量
# True = 1



# 变量命名的规范 显得专业
# 两大命名规范
# 1、 坨峰命命名
#     大坨峰 FirstName
#     小坨峰 firstNameData 首字母小写
#
# 2 、下划体命名
#     first_name
#
# 3、a s i x 等简单变量为临时变量 某个小的区域会使用到

a = '穿着一双红色高跟鞋的漂亮女孩'
A_pretty_girl_in_a_pair_of_red_high_heels = 1
pretty_girl = 1
high_heels_girl = 1
# '
# 变量名称的描述性
# 1、在合适的长度内，越精确越好
# 2、变量名称能让人猜出的类型


